#  Pandas project  - Jacobo Pintos

En este documento buscaremos limpiar el dataset descargado para poder en el siguiente documento realizar un ánalisis sobre los datos extraídos. Para la realización deberemos importar las siguientes librerías:
    - Pandas
    - Numpy
    - Re

In [ ]:
import pandas as pd
import numpy as np
import re

## 1. Dataset extraction and initial filtering

Immportamos el documento y le cambiamos la codificación para que se pueda leer en pandas por medio de la siguiente función. Nombraremos el dataset inicialmente como "data".

In [2]:
data = pd.read_csv('GSAF5.csv', encoding='ISO/8859/1')

Vemos si la importación ha sido correcta y visualizamos una muestra de 20 valores de los datos extraídos.

In [3]:
data.head(10)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2016.09.18.c,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.c-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.c,2016.09.18.c,5993,NaN,NaN
1,2016.09.18.b,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.b-Luciano.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.b,2016.09.18.b,5992,NaN,NaN
2,2016.09.18.a,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.a-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.a,2016.09.18.a,5991,NaN,NaN
3,2016.09.17,17-Sep-16,2016,Unprovoked,AUSTRALIA,Victoria,Thirteenth Beach,Surfing,Rory Angiolella,M,...,NaN,"The Age, 9/18/2016",2016.09.17-Angiolella.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.17,2016.09.17,5990,NaN,NaN
4,2016.09.15,16-Sep-16,2016,Unprovoked,AUSTRALIA,Victoria,Bells Beach,Surfing,male,M,...,2 m shark,"The Age, 9/16/2016",2016.09.16-BellsBeach.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.16,2016.09.15,5989,NaN,NaN
5,2016.09.15.R,15-Sep-16,2016,Boat,AUSTRALIA,Western Australia,Bunbury,Fishing,Occupant: Ben Stratton,NaN,...,NaN,"West Australian, 9/15/2016",2016.09.15.R-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.15.R,2016.09.15.R,5988,NaN,NaN
6,2016.09.11,11-Sep-16,2016,Unprovoked,USA,Florida,"Ponte Vedra, St. Johns County",Wading,male,M,...,3' to 4' shark,"News4Jax, 9/11/2016",2016.09.11-PonteVedra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.11,2016.09.11,5987,NaN,NaN
7,2016.09.07,07-Sep-16,2016,Unprovoked,USA,Hawaii,"Makaha, Oahu",Swimming,female,F,...,"Tiger shark, 10?","Hawaii News Now, 9/7/2016",2016.09.07-Oahu.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.07,2016.09.07,5986,NaN,NaN
8,2016.09.06,06-Sep-16,2016,Unprovoked,NEW CALEDONIA,North Province,Koumac,Kite surfing,David Jewell,M,...,NaN,"TVANouvelles, 9/6/2016",2016.09.06-Jewell.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.06,2016.09.06,5985,NaN,NaN
9,2016.09.05.b,05-Sep-16,2016,Unprovoked,USA,South Carolina,"Kingston Plantation, Myrtle Beach, Horry County",Boogie boarding,Rylie Williams,F,...,NaN,"C. Creswell, GSAF",2016.09.05.b-Williams.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.05.b,2016.09.05.b,5984,NaN,NaN

Debemos empezar a analizar las columnas que requeriremos en el analisis y para ello visualizaremos los nombres de todas las columnas del dataset.

In [4]:
data.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

Renombramos las columnas que requeriremos más tarde y tienen los nombres mal puestos.

In [5]:
data.rename(columns={'Sex ':'Sex'}, inplace=True)

Una vez renombradas las columnas crearemos una nueva base de datos con las columnas que necesitaremos a posteriori para el ánalisis, despreciando aquellas que no nos interesan. Renombramos el dataset con el nombre "sharks" para diferenciarlo del anterior.

In [6]:
colnames=['Year', 'Type', 'Country', 'Area', 'Sex', 'Age', "Fatal (Y/N)"]
sharks = pd.DataFrame(data, columns=colnames)

Una vez creado el sub data set vamos a ver como son los datos que tenemos del mismo y cuantas entradas nulas existen.

In [7]:
sharks.info()

null_cols = sharks.isnull().sum()
null_cols[null_cols > 0]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5992 entries, 0 to 5991
Data columns (total 7 columns):
Year           5992 non-null int64
Type           5992 non-null object
Country        5949 non-null object
Area           5590 non-null object
Sex            5425 non-null object
Age            3311 non-null object
Fatal (Y/N)    5973 non-null object
dtypes: int64(1), object(6)
memory usage: 327.8+ KB

Country          43
Area            402
Sex             567
Age            2681
Fatal (Y/N)      19
dtype: int64

Limitamos el dataset ya que el análisis se basará en ataques desde 1950 y en USA por tanto filtramos el dataset quitando todos los datos que sean de fuera de USA y anteriores a 1950. Una vez realizado vemos cúantos datos nos quedan.

In [8]:
sharks = sharks.drop(sharks[sharks['Year']<1950].index)
sharks = sharks.drop(sharks[sharks['Country']!='USA'].index)

In [9]:
sharks.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1780 entries, 0 to 4264
Data columns (total 7 columns):
Year           1780 non-null int64
Type           1780 non-null object
Country        1780 non-null object
Area           1779 non-null object
Sex            1699 non-null object
Age            1370 non-null object
Fatal (Y/N)    1780 non-null object
dtypes: int64(1), object(6)
memory usage: 111.2+ KB

Tras realizar esta función nos encontramos con una mejor cantidad de datos nulos.Previamente la columna Age contenía un 44% de valores nulos vs el 23% actual.

## 2. Column Type cleaning

Debido al filtrado de años conocemos que todos los valores de la columna "Year" son únicos y enteros por tanto procedemos a analizar la tipología de la columna "Type"

In [10]:
sharks['Type'].value_counts()

Unprovoked      1427
Provoked         150
Invalid          145
Boat              38
Sea Disaster      18
Boating            2
Name: Type, dtype: int64

Podemos ver un total de 145 registros "Invalid" y además de otrás categorías que quiero saber si serán interesantes para mi análisis: 

    - "Boat"
    - "Sea Disaster"
    - "Boating" 
    
Debo anaizarlas individualmente para poder decidir si debo eliminarlas o no.

In [11]:
test_typeinvalid= sharks.drop(sharks[sharks['Type']!='Invalid'].index)
test_typeinvalid.head()

     Year     Type Country            Area  Sex  Age Fatal (Y/N)
50   2016  Invalid     USA  South Carolina    M   27           N
75   2016  Invalid     USA         Florida    M  NaN           N
81   2016  Invalid     USA      California  NaN  NaN           N
116  2015  Invalid     USA         Florida    F    9           N
126  2015  Invalid     USA          Hawaii    M   32           N

Podemos observar como la mayoría de los "Invalid" no representan ataques de tiburón. Estos se dividen en datos no confirmados o cuestionable presencia de tiburón en el suceso. Deben eliminarse.

In [12]:
test_seadisaster= sharks.drop(sharks[sharks['Type']!='Sea Disaster'].index)
test_seadisaster.head()

,Year,Type,Country,Area,Sex,Age,Fatal (Y/N)
935,2009,Sea Disaster,USA,Puerto Rico,M,NaN,Y
1366,2005,Sea Disaster,USA,South Carolina,M,Teens,N
2197,1994,Sea Disaster,USA,Florida,M,7 & 31,Y
2869,1979,Sea Disaster,USA,Florida,M,56,N
2893,1978,Sea Disaster,USA,South Carolina,M,39,N

Los referentes a "Sea Disaster" también deberían ser eliminados ya que la mayoría son de accidentes de avión o barcos que han tenido un percance y no interesan para el análisis.

In [13]:
test_boat= sharks.drop(sharks[sharks['Type']!='Boat'].index)
test_boat.head()

     Year  Type Country        Area  Sex  Age Fatal (Y/N)
29   2016  Boat     USA     Alabama  NaN  NaN           N
35   2016  Boat     USA  California    M  NaN           N
37   2016  Boat     USA  California    M  NaN           N
128  2015  Boat     USA  California    M  NaN           N
233  2015  Boat     USA     Florida    M  NaN           N

In [14]:
test_boating= sharks.drop(sharks[sharks['Type']!='Boating'].index)
test_boating.head()

      Year     Type Country     Area  Sex  Age Fatal (Y/N)
4048  1955  Boating     USA  Florida  NaN  NaN           N
4178  1952  Boating     USA  Florida  NaN  NaN           N

Las variables que contienen "Boat" como las que contienen "Boating" nos valdrían y que son similares.

Debido a esto debemos cambiar el nombre de la variable "Boating" a "Boat" para una mejor visualización de los datos. Este proceso se hará en "sharks".

In [15]:
sharks['Type'] = sharks['Type'].str.replace('Boating', 'Boat')
print(set(sharks['Type']))

{'Provoked', 'Unprovoked', 'Sea Disaster', 'Invalid', 'Boat'}

Para comprobar que este procedimiento se ha hecho correctamente observamos la fila 4048 que estaba clasificada como "Boating" y ahora tiene que estar clasificada como "Boat".

In [16]:
sharks.loc[4048]

Year              1955
Type              Boat
Country            USA
Area           Florida
Sex                NaN
Age                NaN
Fatal (Y/N)          N
Name: 4048, dtype: object

Una vez realizado esto procedemos a eliminar todas los regitros que no contengan en "Type" la variable "Provoked", "Unprovoked" o "Boat".

In [17]:
sharks= sharks.drop(sharks[sharks['Type']=='Invalid'].index)
sharks= sharks.drop(sharks[sharks['Type']=='Sea Disaster'].index)
sharks['Type'].value_counts()

Unprovoked    1427
Provoked       150
Boat            40
Name: Type, dtype: int64

## 3. Column Area cleaning and manipulation

Una vez realizado la limpieza en la columna "Type" pasamos a reasignar las areas geográficas de USA en diferentes bloques y para ello dividiremos las geografías en:

    - East Coast
    - West Coast
    - US Island
    
Observamos los valores nulos que tenemos

In [18]:
null_cols = sharks.isnull().sum()
null_cols[null_cols > 0]

Area      1
Sex      64
Age     343
dtype: int64

Al tener solo un valor nulo en la columna "Area" procedemos a eliminarlo.

In [19]:
sharks =sharks.dropna(subset=['Area'])

Para poder agrupar las zonas geográficas en los tres grupos debemos observar los nombres de cada una para poder luego crear un diccionario que nos ayude a clasificar las zonas.

In [20]:
print(set(sharks['Area']))

{'North & South Carolina', 'Rhode Island', 'Missouri', 'New Jersey', 'Guam', 'Louisiana', 'Georgia', 'Massachusetts', 'Texas', 'Pennsylvania', 'Alabama', 'Kentucky', 'US Virgin Islands', 'South Carolina', 'California', 'Puerto Rico', 'South Carolina ', 'Delaware', 'Hawaii', 'Palmyra Atoll', 'Johnston Atoll', 'Oregon', 'Maine', 'Connecticut', 'Alaska', 'Virginia', 'Wake Island', 'Mississippi', 'New Mexico', 'Maryland', 'New York', 'Florida', 'North Carolina', 'Washington'}

Observamos que tenemos diversas formas de nombrar el estado de South Carolina y otras veces agrupan South Carolina y North Carolina en el mismo grupo. Para una mayor facilidad reemplazaremos el nombre de estas entradas en la columna "Area" por el de "North & South Carolina".

In [21]:
sharks['Area'] = sharks['Area'].str.replace('South Carolina ', 'South Carolina').str.replace('North & South Carolina', 'North Carolina')

In [22]:
print(set(sharks['Area']))
len(set(sharks['Area']))

{'Rhode Island', 'Missouri', 'New Jersey', 'Guam', 'Louisiana', 'Georgia', 'Massachusetts', 'Texas', 'Pennsylvania', 'Alabama', 'Kentucky', 'US Virgin Islands', 'South Carolina', 'California', 'Puerto Rico', 'Delaware', 'Hawaii', 'Palmyra Atoll', 'Johnston Atoll', 'Oregon', 'Maine', 'Connecticut', 'Alaska', 'Virginia', 'Wake Island', 'Mississippi', 'New Mexico', 'Maryland', 'New York', 'Florida', 'North Carolina', 'Washington'}

32

Creamos un diccionario con la tipología que representa cada área y lo agrupamos en otra columna llamada "US zone"

In [23]:
Coast = {'Washington': 'NW coast', 'California': 'SW coast', 'New Mexico': 'SW coast', 
        'Oregon': 'NW coast', 'Alaska': 'NW coast', 'Maryland': 'NE coast', 
        'Pennsylvania': 'NE coast', 'Virginia': 'NE coast', 'Rhode Island': 'NE coast', 
         'Missouri': 'US Central', 'Kentucky': 'US Central', 'Georgia': 'SE coast',
         'New Jersey': 'NE coast', 'Delaware': 'NE coast', 'Alabama': 'SE coast', 
         'New York': 'NE coast', 'North Carolina': 'SE coast', 'Massachusetts': 'NE coast', 
         'Maine': 'NE coast', 'Texas': 'SE coast', 'Louisiana': 'SE coast', 
         'Connecticut': 'NE coast', 'South Carolina': 'SE coast', 'North Carolina': 'SE coast', 
         'Florida': 'SE coast', 'Mississippi': 'SE coast', 'US Virgin Islands': 'Caribean Islands', 
         'Guam': 'Philippine Islands', 'Johnston Atoll': 'Pacific Islands', 'Wake Island': 'Pacific Islands', 
         'Puerto Rico': 'Caribean Islands', 'Hawaii': 'Pacific Islands', 'Palmyra Atoll': 'Pacific Islands'}

len(Coast)

32

In [24]:
sharks['US zone']=sharks['Area'].map(Coast)
sharks.head()

   Year        Type Country     Area Sex  Age Fatal (Y/N)          US zone
0  2016  Unprovoked     USA  Florida   M   16           N         SE coast
1  2016  Unprovoked     USA  Florida   M   36           N         SE coast
2  2016  Unprovoked     USA  Florida   M   43           N         SE coast
6  2016  Unprovoked     USA  Florida   M  60s           N         SE coast
7  2016  Unprovoked     USA   Hawaii   F   51           N  Pacific Islands

In [25]:
sharks['Area'].value_counts()

Florida              852
California           223
Hawaii               198
South Carolina        98
North Carolina        72
Texas                 50
Oregon                27
Virginia              12
Alabama               11
New Jersey            10
Georgia                8
Louisiana              7
Massachusetts          7
Puerto Rico            7
New York               5
Delaware               4
US Virgin Islands      4
Maryland               3
Mississippi            3
Rhode Island           2
Palmyra Atoll          2
Missouri               1
Guam                   1
Maine                  1
Pennsylvania           1
Washington             1
Kentucky               1
Connecticut            1
Alaska                 1
Wake Island            1
New Mexico             1
Johnston Atoll         1
Name: Area, dtype: int64

In [26]:
sharks['US zone'].value_counts()

SE coast              1101
SW coast               224
Pacific Islands        202
NE coast                46
NW coast                29
Caribean Islands        11
US Central               2
Philippine Islands       1
Name: US zone, dtype: int64

## 4. Column Sex cleaning

En primer lugar observamos los valores de la columna que son nulos para decidir que realizamos con ello.

In [27]:
null_cols = sharks.isnull().sum()
null_cols[null_cols > 0]

Sex     64
Age    342
dtype: int64

Observamos que solamente tenemos 64 valores nulos. Aunque es una cifra pequeña y la podemos eliminar, es mejor convertir estos valores como desconocidos en vez de eliminarlos y perder la totalidad de los valores.

In [28]:
sharks[['Sex']] = sharks[['Sex']].fillna("Uknown")

Observamos los nombres de las variables y cuantos tenemos de cada tipo.

In [29]:
sharks['Sex'].value_counts()

M         1287
F          263
Uknown      64
M            1
lli          1
Name: Sex, dtype: int64

In [30]:
print(set(sharks['Sex']))

{'Uknown', 'M', 'F', 'lli', 'M '}

Renombramos las variables que están mal como "M " con un espacio lo cual es un error al introducirla y la convertimos a "M" o "lli" que al no saber que representa la sumamos al grupo de "Uknown". 

Además de esto cambiaremos los datos de "M" y "F" por "Male" y "Female".

In [31]:
sharks['Sex'] = sharks['Sex'].str.replace('M ', 'Male')

In [32]:
sharks['Sex'] = sharks['Sex'].str.replace('lli', 'Uknown').str.replace('M', 'Male').str.replace('F', 'Female')
sharks['Sex'].value_counts()

Male       1287
Female      263
Uknown       65
Maleale       1
Name: Sex, dtype: int64

In [33]:
sharks['Sex'] = sharks['Sex'].str.replace('Maleale', 'Male')

In [34]:
sharks['Sex'].value_counts()

Male      1288
Female     263
Uknown      65
Name: Sex, dtype: int64

In [35]:
null_cols = sharks.isnull().sum()
null_cols[null_cols > 0]

Age    342
dtype: int64

## 5. Column Age cleaning

Como en anteriores ocasiones observamos cuantos valores nulos existen de la columna "Age".

In [36]:
null_cols = sharks.isnull().sum()
null_cols[null_cols > 0]

Age    342
dtype: int64

Al igual que en el caso de la columna "Sex" merece más la pena convertir los valores a "Uknown" que eliminarlos.

In [37]:
sharks[['Age']] = sharks[['Age']].fillna("Uknown")

In [38]:
print(set(sharks['Age']))
len(set(sharks['Age']))

{'9 & 12', '34', '\xa0 ', 'Elderly', 'teen', '30', 'Uknown', '14', 'Teen', '33', '66', '28', '57', '52', '32', '8', '65', '21 or 26', '36', '59', 'adult', '37', '68', '15', '44', '71', '64', '47', '20s', '24', '50', '9', '11', '27', '49', '46', '60', '12', '7', '31', '38', '60s', '26', '29', '6½', '55', "60's", '23', '18', '50s', '17', '16', '41', '58', '5', '75', '43', '63', '48', '35', '53', '6', '61', '73', '10', '13', '42', '20', '22', '56', '25', '70', '40', '39', '69', '19', '86', '45', '87', '62', '3', '30s', 'mid-30s', '21', '51', '12 or 13', '54'}

87

Debido a la gran suciedad de la muestra pero que el número de entradas no es extremadamente grande y algunos valores se pueden corregir, cambiaremos los datos uno a uno por la fórmula replace.

In [39]:
sharks['Age'] = sharks['Age'].str.replace('21 or 26','21').str.replace('50s','50').str.replace('Teen','Uknown').str.replace('\xa0 ', 'Uknown').str.replace('teen', 'Uknown').str.replace('60s', 'Uknown').str.replace('9 & 12', '9').str.replace('12 or 13', '12').str.replace('adult', 'Uknown').str.replace('mid-30s', 'Uknown').str.replace('6½', '6').str.replace('20s', 'Uknown').str.replace('Elderly', 'Uknown').str.replace('30s', 'Uknown').str.replace('60\'s', 'Uknown')

In [40]:
print(set(sharks['Age']))
len(set(sharks['Age']))

{'44', '23', '34', '71', '18', '40', '64', '30', '47', '39', 'Uknown', '17', '14', '16', '50', '24', '9', '11', '19', '28', '27', '57', '58', '33', '41', '5', '52', '49', '43', '32', '8', '69', '46', '63', '60', '86', '12', '35', '48', '7', '45', '87', '31', '65', '3', '62', '38', '53', '26', '36', '59', '6', '61', '75', '29', '37', '73', '10', '21', '13', '68', '42', '20', '22', '66', '55', '51', '25', '56', '54', '15', '70'}

72

## 6. Column Fatal (Y/N) renaming

Para la columna Fatal (Y/N) haremos una operación de renaming de las variables y de la columna de cara a su exportación final

In [47]:
sharks.rename(columns={'Fatal (Y/N)':'Fatal Attack'}, inplace=True)

In [48]:
sharks['Fatal Attack'] = sharks['Fatal Attack'].str.replace('Y','Yes').str.replace('N','No')

In [49]:
sharks.head()

,Year,Type,Country,US zone,Area,Sex,Age,Fatal Attack
0,2016,Unprovoked,USA,SE coast,Florida,Male,16,Noo
1,2016,Unprovoked,USA,SE coast,Florida,Male,36,Noo
2,2016,Unprovoked,USA,SE coast,Florida,Male,43,Noo
6,2016,Unprovoked,USA,SE coast,Florida,Male,Uknown,Noo
7,2016,Unprovoked,USA,Pacific Islands,Hawaii,Female,51,Noo

## 7. Dataset final columns order and exporting

Reordenamos las columnas y exportamos el Dataset.

In [50]:
column_order = ['Year', 'Type', 'Country','US zone','Area','Sex','Age','Fatal Attack']

sharks = sharks[column_order]
sharks.head()

,Year,Type,Country,US zone,Area,Sex,Age,Fatal Attack
0,2016,Unprovoked,USA,SE coast,Florida,Male,16,Noo
1,2016,Unprovoked,USA,SE coast,Florida,Male,36,Noo
2,2016,Unprovoked,USA,SE coast,Florida,Male,43,Noo
6,2016,Unprovoked,USA,SE coast,Florida,Male,Uknown,Noo
7,2016,Unprovoked,USA,Pacific Islands,Hawaii,Female,51,Noo

In [51]:
sharks.to_csv('sharks.csv', sep=',', index=False)